Renova/src/Documents/ОтчетОПродажахИПроизводстве/ОтчетОПродажахИПроизводстве.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПродажахИПроизводстве</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.Производство</registerRecords>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидДокументаПродажиИПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокВидовПродукции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фабрика</name>
    <type>
      <types>CatalogRef.ФабрикиИСмены</types>
    </type>
  </attributes>
  <attributes>
    <name>Фирма</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ВидыПродукции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МесяцУчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.МоделиПродукции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Renova/src/Documents/ОтчетОПродажахИПроизводстве/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ВидДокумента") Тогда
		ВидДокумента = Параметры.Отбор.ВидДокумента;
		Если ВидДокумента = Перечисления.ВидДокументаПродажиИПроизводство.Продажи Тогда
			Заголовок = "Отчеты о Продажах";
			Элементы.Фабрика.Видимость = Ложь;
			Элементы.Фирма.Видимость = Истина;
		Иначе
			Заголовок = "Отчеты о Производстве";				
			Элементы.Фабрика.Видимость = Истина;
			Элементы.Фирма.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	ПараметрыФормы = Новый Структура("ВидДокумента", ВидДокумента);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.Форма.ФормаДокумента", ПараметрыФормы,, УникальныйИдентификатор);
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	ПараметрыФормы.Вставить("ВидДокумента", ВидДокумента);
	ОткрытьФорму("Документ.ОтчетОПродажахИПроизводстве.Форма.ФормаДокумента", ПараметрыФормы,
		ЭтотОбъект, ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
